import { Box } from "@chakra-ui/react";
import { MarkdownViewer } from "../QuestionsPage";

const markdown = `
# به هفتمین دوره‌ی مسابقه‌ی «هاردوار» خوش آمدید!

شرکت در این مسابقه به منزله‌ی پذیرش کامل شرایط و قوانین زیر است. لطفاً بخش‌های زیر را با دقت مطالعه بفرمایید.

## ۱. شرایط کلی شرکت در مسابقه

 **۱.۱.** شرکت در مسابقه برای تمامی علاقه‌مندان به مباحث اینترنت اشیاء، امنیت و مهندسی معکوس سخت‌افزار آزاد است.  
 **۱.۲.** شرکت‌کنندگان تنها می‌توانند به‌صورت گروهی با تیم‌هایی متشکل از ۳ نفر در مسابقه شرکت نمایند.  
 **۱.۳.** هر شرکت‌کننده فقط می‌تواند عضو یک تیم باشد. استفاده از هویت‌های جعلی یا عضویت در چند تیم منجر به رد صلاحیت در تمامی تیم‌ها خواهد شد.

## ۲. نحوه‌ی برگزاری مسابقه

 **۲.۱.** مسابقه به‌صورت حضوری برگزار می‌شود و امکان شرکت به صورت مجازی وجود ندارد.  
 **۲.۲.** به هر تیم یک یا چند دستگاه سخت‌افزاری (مانند میکروکنترلر، بوردهای توسعه یا مدارهای خاص) به‌همراه مستندات داده خواهد شد. تیم‌ها موظف هستند که تا جای امکان از این سخت‌‌‌افزارها به خوبی مراقبت کنند.  
 **۲.۳.** اهداف کلی این مسابقه، نوشتن کدهایی منجر به عملکرد مطلوب مانند اجرای بازی، استخراج فلگ‌ها یا اجرای سناریوهای مشخص شده در چارچوب قوانین مسابقه شود، است.

## ۳. محدودیت‌ها و ممنوعیت‌ها

 **۳.۱.** استفاده از حملات DOS (منع سرویس) یا آسیب به زیرساخت مسابقه ممنوع است.  
 **۳.۲.** آسیب فیزیکی عمدی به تجهیزات مسابقه باعث رد صلاحیت خواهد شد و مستلزم پرداخت خسارت خواهد بود.  
 **۳.۳.** استفاده از ابزارها و اسکریپت‌های مخرب که به سایر تیم‌ها یا سامانه‌ی داوری آسیب بزند، ممنوع است.  
 **۳.۴.** هرگونه همکاری، تبادل فلگ یا جواب بین تیم‌ها ممنوع است و برای هر دو تیم تخلف محسوب می‌شود. این تخلف نمره‌ی مربوطه برای هر دو گروه را صفر خواهد کرد.

## ۴. نحوه‌ی امتیازدهی

 **۴.۱.** به هر چالش، امتیازی مشخص بر اساس تعداد حل‌های آن تعلق می‌گیرد.  
 **۴.۲.** سیستم امتیازدهی، به‌صورت داینامیک است و امتیاز حل هر سوال با رابطه‌ی مشخصی محاسبه خواهد شد.  

$$
\\left\\lfloor19 + \\frac{981}{1+(\\frac{\\max\\{0, \\#S - 1\\}}{11.92})^{1.21}}\\right\\rfloor
$$

 **۴.۳.** زمان ثبت هر پاسخ یا فلگ و مجموع امتیازات تیم، جایگاه نهایی را مشخص می‌کند.  
 **۴.۴.** با توجه به این‌که کیفیت خروجی تحویلی در چالش‌هایی که نمره‌دهی دستی دارند حائز اهمیت است، نمره‌ی مربوط به این بخش توسط داوران تیم علمی می‌تواند به صورت دستی تغییر پیدا کند.  
 **۴.۵.** تحویل چالش‌هایی که فلگ ندارند، توسط برگزارکنندگان ضبط خواهد شد و نسخه‌ی ضبطی، مستند مورد استفاده برای بررسی اعتراض‌ها خواهد بود.

## ۵. مالکیت و استفاده از داده‌ها

 **۵.۱.** کلیه‌ی کدها، گزارش‌ها و مستنداتی که توسط شرکت‌کنندگان تولید می‌شود، صرفاً برای ارزیابی و توسعه‌ی مسابقه استفاده شده و حقوق معنوی آن متعلق به تولیدکننده است.  
 **۵.۲.** برگزارکنندگان حق دارند داده‌های آماری، نتایج و تصاویر مسابقه را برای اهداف تبلیغاتی یا آموزشی استفاده کنند.

## ۶. موارد داوری و تصمیم‌گیری

 **۶.۱.** تمامی اعتراض‌ها و موارد خاص باید حداکثر تا یک ساعت پس از پایان مسابقه اعلام شوند.  
 **۶.۲.** تصمیم نهایی در خصوص امتیازدهی، تخلفات، یا شرایط پیش‌بینی‌نشده در اختیار تیم داوری خواهد بود.  
 **۶.۳.** تیم داوری حق دارد در صورت مشاهده‌ی هرگونه تقلب یا رفتار غیرحرفه‌ای، تیم را از مسابقه حذف کند.

## ۷. پشتیبانی و سوالات

 **۷.۱.** در طول مسابقه، کانال رسمی پشتیبانی جهت پاسخ‌گویی به سوالات فنی در دسترس خواهد بود.  
 **۷.۲.** پرسش‌ها باید به‌صورت عمومی و از طریق کانال رسمی مطرح شوند، مگر در موارد خاص.

`;

const Conditions = () => {
  return (
    <div dir="rtl">
      <Box px="10%" paddingTop="100px">
        <MarkdownViewer markdown={markdown} />
      </Box>
    </div>
  );
};

export default Conditions;